import './assets/styles/main.scss';
import './assets/ts/add-base-html';
import './assets/ts/utilities/utilities';

console.log(`
Приветствуем Вас в нашем Online-Store!
Для удобства проверки сообщаем Вам дополнительную информацию:
1. Работа роутера реализована через location.hash (поэтому не удивляйтесь присутствию  значка # в адрессной строке)
2. Приложение реализовано на Vanilla JS, без использования библиотек и фреймворков
3. Все требования тех.задания реализованы.

   Предварительная самооценка за задание: 300 баллов.

   [x] Страница товаров с фильтрами (+120 баллов).
   [x] Страница корзины выбранных товаров (+60 баллов).
   [x] Модальное окно оформления(покупки) выбранных товаров (+50 баллов).
   [x] Страница с описанием товара (+40 баллов).
   [x] Header, содержащий количество добавленных в корзину товаров и общую сумму покупок (+20 баллов).
   [x] Страница 404 (+10 баллов).

    В случае возникновения неоднозначных ситуаций в процессе пользования нашим приложением, будем рады дать поянения в Discord.

Спасибо за проверку.
Удачи Вам!
`)